Extensions/УВМ/InformationRegisters/УсловияУченическогоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УсловияУченическогоДоговора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОбязательств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаОбязательств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УченическийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УченическийДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/CommonModules/ОбучениеРазвитие/Ext/Module.bsl
&ИзменениеИКонтроль("ОбязательстваСотрудниковПоУченическимДоговорам")
Функция УВМ_ОбязательстваСотрудниковПоУченическимДоговорам(ФизическоеЛицо, Организация, ДатаСреза)

	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияУченическогоДоговора.УченическийДоговор КАК УченическийДоговор,
	|	СУММА(УсловияУченическогоДоговора.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.УсловияУченическогоДоговора КАК УсловияУченическогоДоговора
	|ГДЕ
	|	&ДатаСреза МЕЖДУ УсловияУченическогоДоговора.ДатаНачалаОбязательств И УсловияУченическогоДоговора.ДатаОкончанияОбязательств
	|	И УсловияУченическогоДоговора.ФизическоеЛицо = &ФизическоеЛицо
	|	И УсловияУченическогоДоговора.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияУченическогоДоговора.УченическийДоговор
	|
	|ИМЕЮЩИЕ
	|	СУММА(УсловияУченическогоДоговора.Сумма) > 0";
	#Вставка
	// + БаринбергГМ 20220625 (9837)
	// пацаны из фирмы 1С не вкурсе как работает "МЕЖДУ"
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияУченическогоДоговора.УченическийДоговор КАК УченическийДоговор,
	|	СУММА(УсловияУченическогоДоговора.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.УсловияУченическогоДоговора КАК УсловияУченическогоДоговора
	|ГДЕ
	|	УсловияУченическогоДоговора.ДатаНачалаОбязательств <= &ДатаСреза
	|	И УсловияУченическогоДоговора.ДатаОкончанияОбязательств > &ДатаСреза
	|	И УсловияУченическогоДоговора.ФизическоеЛицо = &ФизическоеЛицо
	|	И УсловияУченическогоДоговора.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияУченическогоДоговора.УченическийДоговор
	|
	|ИМЕЮЩИЕ
	|	СУММА(УсловияУченическогоДоговора.Сумма) > 0";
	// - БаринбергГМ 20220625 (9837)
	#КонецВставки

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//++dar 10.04.23 (99225)
// выводит информацию об ученических договорах сотрудников
Процедура УведомитьОбОбязательствахСотрудниковПоУченическимДоговорам(ФизическоеЛицо, Организация, ДатаСреза) Экспорт

	УдержанияПоДоговорам = ОбязательстваСотрудниковПоУченическимДоговорам(
	ФизическоеЛицо, Организация, ДатаСреза);

	Если УдержанияПоДоговорам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаКоллекции Из УдержанияПоДоговорам Цикл
		ОбщегоНазначения.СообщитьПользователю("Обратите внимание! У " + ФизическоеЛицо + " есть обязательства по ученическому договору "
			+ СтрокаКоллекции.УченическийДоговор + " на сумму: " + СтрокаКоллекции.Сумма + " руб!");
	КонецЦикла;
		
КонецПроцедуры

&ИзменениеИКонтроль("ДополнитьТаблицуУдержанийДаннымиПоУченическимДоговорамСотрудника")
Процедура УВМ_ДополнитьТаблицуУдержанийДаннымиПоУченическимДоговорамСотрудника(Сотрудник, ДатаУвольнения, МенеджерРасчета)

	ДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
	Истина, Сотрудник, "ГоловнаяОрганизация, ФизическоеЛицо, Организация, ОсновноеРабочееМестоВОрганизации");

	ОбщегоНазначенияКлиентСервер.Проверить(ДанныеСотрудников.Количество() > 0, 
	НСтр("ru = 'Не удалось получить кадровые данные сотрудника. Запрашивались: Головная организация и Физическое лицо.'"));

	ДанныеСотрудника = ДанныеСотрудников[0];

	Если Не ДанныеСотрудника.ОсновноеРабочееМестоВОрганизации Тогда
		Возврат;
	КонецЕсли;

	УдержанияПоДоговорам = ОбязательстваСотрудниковПоУченическимДоговорам(
	ДанныеСотрудника.ФизическоеЛицо, ДанныеСотрудника.Организация, ДатаУвольнения);

	Если УдержанияПоДоговорам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВидыРасчета = РасчетЗарплаты.УдержанияПоКатегории(Перечисления.КатегорииУдержаний.ОбязательстваПоУченическомуДоговору);
	ОбщегоНазначенияКлиентСервер.Проверить(ВидыРасчета.Количество() > 0, 
	НСтр("ru = 'Не удалось найти ни одного вида удержания категории «Обязательства по ученическому договору»'"));

	Для Каждого СтрокаКоллекции Из УдержанияПоДоговорам Цикл
		НоваяСтрока = Обработки.МенеджерРасчетаЗарплаты.СтрокаТаблицыУдержаний(МенеджерРасчета.Зарплата.Удержания);
		НоваяСтрока.ДокументОснование = СтрокаКоллекции.УченическийДоговор;
		НоваяСтрока.ФизическоеЛицо = ДанныеСотрудника.ФизическоеЛицо;
		НоваяСтрока.ГоловнаяОрганизация = ДанныеСотрудника.ГоловнаяОрганизация;
		НоваяСтрока.Категория = Перечисления.КатегорииУдержаний.ОбязательстваПоУченическомуДоговору;
		НоваяСтрока.Удержание = ВидыРасчета[0];
		НоваяСтрока.Результат = СтрокаКоллекции.Сумма;
		НоваяСтрока.ДатаНачала = ДатаУвольнения;
		НоваяСтрока.ДатаОкончания = ДатаУвольнения;
		#Вставка
		// + БаринбергГМ 20220625 (9837)
		// оповестим сотрудника департамента персонала
		ОбщегоНазначения.СообщитьПользователю("Обратите внимание! У " + НоваяСтрока.ФизическоеЛицо + " есть обязательства по ученическому договору "
			+ НоваяСтрока.ДокументОснование + " на сумму: " + НоваяСтрока.Результат + " руб!");
		// - БаринбергГМ 20220625 (9837)
		#КонецВставки
	КонецЦикла;

КонецПроцедуры
//--dar 10.04.23 (99225)
